"""
문제:
세준이는 기말고사를 망쳤다.
세준이는 점수를 조작해서 집에 가져가기로 했다.
일단 세준이는 자기 점수 중에 최댓값을 골랐다. 이 값을 M이라고 한다.
그리고 나서 모든 점수를 점수/M*100으로 고쳤다.
예를 들어, 세준이의 최고점이 70이고, 수학점수가 50이었으면 수학점수는 50/70*100이 되어 71.43점이 된다.
세준이의 성적을 위의 방법대로 새로 계산했을 때, 새로운 평균을 구하는 프로그램을 작성하시오.
입력:
첫째 줄에 시험 본 과목의 개수 N이 주어진다. 이 값은 1000보다 작거나 같다.
둘째 줄에 세준이의 현재 성적이 주어진다.
이 값은 100보다 작거나 같은 음이 아닌 정수이고, 적어도 하나의 값은 0보다 크다.
출력:
첫째 줄에 새로운 평균을 출력한다. 정답과의 절대/상대 오차는 10-2까지 허용한다.
"""
N = int(input()) # 과목 개수 N 입력

s = input().split() # 각 과목 점수를 리스트로 S에 저장
l = [] # 빈 리스트 초기화
for i in range(0,N):
    l.append(int(s[i])) # s에 있는 과목 점수를 l에 하나씩 대입

max = 0 # 최댓값
sum = 0 # 점수 총합
for i in range(0, N):
    if max < l[i]: # i번째 과목이 최댓값보다 크면
        max = l[i] # 최댓값 변경
    sum += l[i] # 과목 총합 구하기

avg = sum / N # 과목 평균구하기

newavg = avg / max * 100 # 새로운 평균 구하기

print("%.2f" %newavg) # 소수 둘째 자리까지만 출력